export enum AuthProvider {
  EMAIL = 'EMAIL',
  GOOGLE = 'GOOGLE',
  APPLE = 'APPLE',
}
// "OWNER" | "FREE_USER" | "PAID_USER" | "BETA_TESTER"
export enum Role {
  OWNER = 'OWNER',
  FREE_USER = 'FREE_USER',
  PAID_USER = 'PAID_USER',
  BETA_TESTER = 'BETA_TESTER',
}

export enum InterestingTopic {
  國際 = '國際',
  財經 = '財經',
  科技 = '科技',
  教育 = '教育',
  社會 = '社會',
  文化 = '文化',
  環境 = '環境',
  娛樂 = '娛樂',
  健康 = '健康',
  軍隊 = '軍隊',
  運動 = '運動',
  觀點 = '觀點',
}

export enum InterestingRegionOrCountry {
  // 台灣地區
  台北市 = '台北市',
  新北市 = '新北市',
  桃園市 = '桃園市',
  台中市 = '台中市',
  台南市 = '台南市',
  高雄市 = '高雄市',
  基隆市 = '基隆市',
  新竹市 = '新竹市',
  嘉義市 = '嘉義市',
  宜蘭縣 = '宜蘭縣',
  花蓮縣 = '花蓮縣',
  台東縣 = '台東縣',
  南投縣 = '南投縣',
  彰化縣 = '彰化縣',
  雲林縣 = '雲林縣',
  屏東縣 = '屏東縣',
  苗栗縣 = '苗栗縣',
  新竹縣 = '新竹縣',
  嘉義縣 = '嘉義縣',
  澎湖縣 = '澎湖縣',
  金門縣 = '金門縣',
  連江縣 = '連江縣',

  // 其他地區
  香港 = '香港',
  中國 = '中國',
  美國 = '美國',
  加沙 = '加沙',
  以色列 = '以色列',
  烏克蘭 = '烏克蘭',
  歐盟 = '歐盟',
  日本 = '日本',
  韓國 = '韓國',
}

export enum Identity {
  台中人 = '台中人',
  台北人 = '台北人',
  台南人 = '台南人',
  台東人 = '台東人',
  嘉義人 = '嘉義人',
  基隆人 = '基隆人',
  宜蘭人 = '宜蘭人',
  屏東人 = '屏東人',
  彰化人 = '彰化人',
  新北人 = '新北人',
  新竹人 = '新竹人',
  桃園人 = '桃園人',
  澎湖人 = '澎湖人',
  花蓮人 = '花蓮人',
  苗栗人 = '苗栗人',
  連江人 = '連江人',
  金門人 = '金門人',
  雲林人 = '雲林人',
  高雄人 = '高雄人',
  南投人 = '南投人',
  其他 = '其他',
}

export enum PoliticalStance {
  深綠 = '深綠',
  淺綠 = '淺綠',
  中立 = '中立',
  淺藍 = '淺藍',
  深藍 = '深藍',
}
